const MASTER_SCHEDULE = {
  "periods": [
    {
      "id": "p1",
      "label": "第一节",
      "time": "8:20-9:00"
    },
    {
      "id": "p2",
      "label": "第二节",
      "time": "9:15-9:55"
    },
    {
      "id": "p3",
      "label": "第三节",
      "time": "10:25-11:05"
    },
    {
      "id": "p4",
      "label": "第四节",
      "time": "11:20-12:00"
    },
    {
      "id": "p5",
      "label": "第五节",
      "time": "14:15-14:55"
    },
    {
      "id": "p6",
      "label": "第六节",
      "time": "15:10-15:50"
    }
  ],
  "classes": [
    "一(1)",
    "一(2)",
    "二（1）",
    "二（2）",
    "三（1）",
    "三（2）",
    "四（1)",
    "四（2）",
    "五（1）",
    "五（2）",
    "六（1）",
    "六（2）"
  ],
  "schedule": {
    "一(1)": {
      "周一": {
        "p1": "语文 （梁萍萍）",
        "p2": "数学 （陈结泳）",
        "p3": "语文 （梁萍萍）",
        "p4": "信息科技 （冯雁冰）",
        "p5": "体育与健康  （梁萍萍）",
        "p6": "道德与法治 （陈结泳）"
      },
      "周二": {
        "p1": "语文 （梁萍萍）",
        "p2": "综合实践 （刘中义）",
        "p3": "校本课程之心理健康 （杨凤清、林雪美）",
        "p4": "语文 （梁萍萍）",
        "p5": "音乐  （邓丽梅）",
        "p6": "体育与健康  （陈结泳）"
      },
      "周三": {
        "p1": "语文 （梁萍萍）",
        "p2": "数学  （陈结泳）",
        "p3": "体育与健康 （梁超财 ）",
        "p4": "语文 （梁萍萍）",
        "p5": "美术  （杨凤清）",
        "p6": "科学 （钱少环）"
      },
      "周四": {
        "p1": "道德与法治 （陈结泳）",
        "p2": "语文 （梁萍萍）",
        "p3": "劳动 （林雪美）",
        "p4": "英语  （陈丽杰）",
        "p5": "体育与健康 （梁超财）",
        "p6": "美术  （杨凤清）"
      },
      "周五": {
        "p1": "数学  （陈结泳）",
        "p2": "语文 （梁萍萍）",
        "p3": "英语  （陈丽杰）",
        "p4": "体育与健康 （梁超财）",
        "p5": "音乐  （邓丽梅）",
        "p6": "语文之写字 （梁萍萍）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "一(2)": {
      "周一": {
        "p1": "语文 （何瑞晶）",
        "p2": "语文  （何瑞晶）",
        "p3": "数学  （陈结泳）",
        "p4": "体育与健康（梁超财）",
        "p5": "综合实践 （刘中义）",
        "p6": "音乐  （邓丽梅）"
      },
      "周二": {
        "p1": "语文 （何瑞晶）",
        "p2": "科学 （何瑞晶）",
        "p3": "体育与健康  （梁超财）",
        "p4": "语文  （何瑞晶）",
        "p5": "道德与法治 （陈结泳）",
        "p6": "英语 （单亚飞）"
      },
      "周三": {
        "p1": "数学  （陈结泳）",
        "p2": "语文  （何瑞晶）",
        "p3": "美术  （杨凤清）",
        "p4": "体育与健康  （单亚飞）",
        "p5": "校本课程之心理健康 （何瑞晶、林雪美）",
        "p6": "道德与法治 （陈结泳）"
      },
      "周四": {
        "p1": "语文  （何瑞晶）",
        "p2": "语文  （何瑞晶）",
        "p3": "英语 （单亚飞）",
        "p4": "体育与健康 （陈结泳）",
        "p5": "劳动 （林雪美）",
        "p6": "音乐  （邓丽梅）"
      },
      "周五": {
        "p1": "语文  （何瑞晶）",
        "p2": "语文之写字  （何瑞晶）",
        "p3": "数学  （陈结泳）",
        "p4": "美术 （杨凤清）",
        "p5": "信息科技 （冯雁冰）",
        "p6": "体育与健康 （梁超财）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "二（1）": {
      "周一": {
        "p1": "语文  （刘小莉）",
        "p2": "语文  （刘小莉）",
        "p3": "数学  （李彩芬）",
        "p4": "英语 （唐楚儿）",
        "p5": "体育与健康 （李彩芬）",
        "p6": "综合实践 （林雪美）"
      },
      "周二": {
        "p1": "道德与法治 （刘小莉）",
        "p2": "语文  （刘小莉）",
        "p3": "美术  （程春苗）",
        "p4": "体育与健康 （曾乐怡）",
        "p5": "科学 （李彩芬）",
        "p6": "音乐  （张妙娟）"
      },
      "周三": {
        "p1": "语文  （刘小莉）",
        "p2": "语文  （刘小莉）",
        "p3": "体育与健康 （廉政）",
        "p4": "数学  （李彩芬）",
        "p5": "英语  （唐楚儿）",
        "p6": "道德与法治 （刘小莉）"
      },
      "周四": {
        "p1": "数学  （李彩芬）",
        "p2": "语文  （刘小莉）",
        "p3": "语文之写字  （刘小莉）",
        "p4": "信息科技 （冯雁冰）",
        "p5": "体育与健康 （廉政）",
        "p6": "劳动 （张彩霞）"
      },
      "周五": {
        "p1": "语文  （刘小莉）",
        "p2": "数学  （李彩芬）",
        "p3": "美术  （程春苗）",
        "p4": "校本课程之心理健康 （刘小莉、林雪美）",
        "p5": "音乐  （张妙娟）",
        "p6": "体育与健康  （廉政）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "二（2）": {
      "周一": {
        "p1": "语文 （莫婉霞）",
        "p2": "语文 （莫婉霞）",
        "p3": "劳动 （张彩霞）",
        "p4": "数学  （李彩芬）",
        "p5": "美术  （程春苗）",
        "p6": "体育与健康 （莫婉霞）"
      },
      "周二": {
        "p1": "道德与法治 （莫婉霞）",
        "p2": "语文 （莫婉霞）",
        "p3": "音乐  （张妙娟）",
        "p4": "英语 （唐楚儿）",
        "p5": "体育与健康 （廉政）",
        "p6": "科学 （李彩芬）"
      },
      "周三": {
        "p1": "语文 （莫婉霞）",
        "p2": "语文 （莫婉霞）",
        "p3": "校本课程之心理健康 （程春苗、林雪美）",
        "p4": "体育与健康 （廉政）",
        "p5": "数学  （李彩芬）",
        "p6": "美术  （程春苗）"
      },
      "周四": {
        "p1": "语文 （莫婉霞）",
        "p2": "数学  （李彩芬）",
        "p3": "信息科技 （冯雁冰）",
        "p4": "音乐 （张妙娟）",
        "p5": "体育与健康 （李彩芬）",
        "p6": "英语 （唐楚儿）"
      },
      "周五": {
        "p1": "语文 （莫婉霞）",
        "p2": "语文之写字 （莫婉霞）",
        "p3": "体育与健康  （廉政）",
        "p4": "数学  （李彩芬）",
        "p5": "道德与法治 （莫婉霞）",
        "p6": "综合实践 （林雪美）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "三（1）": {
      "周一": {
        "p1": "数学 （黄东强）",
        "p2": "语文  （邓肖慧）",
        "p3": "校本课程职心理健康  （曾乐怡、林雪美）",
        "p4": "美术  （杨凤清）",
        "p5": "科学 （李坤雄）",
        "p6": "体育与健康 （邓肖慧）"
      },
      "周二": {
        "p1": "道德与法治 （邓肖慧）",
        "p2": "语文  （邓肖慧）",
        "p3": "音乐  （邓丽梅）",
        "p4": "体育与健康  （黄东强）",
        "p5": "劳动/综合实践（曾乐怡）",
        "p6": "信息科技 （冯雁冰）"
      },
      "周三": {
        "p1": "数学  （黄东强）",
        "p2": "语文  （邓肖慧）",
        "p3": "英语 （曾乐怡）",
        "p4": "道德与法治 （邓肖慧）",
        "p5": "科学 （李坤雄）",
        "p6": "体育与健康  （梁超财）"
      },
      "周四": {
        "p1": "语文  （邓肖慧）",
        "p2": "英语 （曾乐怡）",
        "p3": "数学 （黄东强）",
        "p4": "音乐、美术  （邓丽梅、杨凤清）",
        "p5": "语文之写字 （邓肖慧）",
        "p6": "体育与健康 （黄东强）"
      },
      "周五": {
        "p1": "语文  （邓肖慧）",
        "p2": "语文  （邓肖慧）",
        "p3": "英语 （曾乐怡）",
        "p4": "数学  （黄东强）",
        "p5": "体育与健康 （梁超财）",
        "p6": "校本课程之主题班会 （邓肖慧）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "三（2）": {
      "周一": {
        "p1": "语文  （梁燕娥）",
        "p2": "英语 （曾乐怡）",
        "p3": "体育与健康  （梁超财）",
        "p4": "数学 （黄东强）",
        "p5": "校本课程之心理健康 （曾乐怡、林雪美）",
        "p6": "校本课程之主题班会 （杨凤清）"
      },
      "周二": {
        "p1": "语文  （梁燕娥）",
        "p2": "语文  （梁燕娥）",
        "p3": "英语 （曾乐怡）",
        "p4": "美术 （杨凤清）",
        "p5": "体育与健康 （黄东强）",
        "p6": "音乐  （邓丽梅）"
      },
      "周三": {
        "p1": "语文  （梁燕娥）",
        "p2": "综合实践/劳动（曾乐怡）",
        "p3": "数学  （黄东强）",
        "p4": "体育与健康 （梁超财 ）",
        "p5": "语文之书法  （梁燕娥）",
        "p6": "信息科技 （冯雁冰）"
      },
      "周四": {
        "p1": "英语 （曾乐怡）",
        "p2": "数学 （黄东强）",
        "p3": "道德与法治 （梁燕娥）",
        "p4": "语文  （梁燕娥）",
        "p5": "科学 （张彩霞）",
        "p6": "体育与健康 （梁燕娥）"
      },
      "周五": {
        "p1": "道德与法治 （梁燕娥）",
        "p2": "数学 （黄东强）",
        "p3": "语文  （梁燕娥）",
        "p4": "科学 （张彩霞）",
        "p5": "体育与健康 （黄东强）",
        "p6": "音乐、美术 （邓丽梅、杨凤清）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "四（1)": {
      "周一": {
        "p1": "语文 （钱少环）",
        "p2": "数学 （李坤雄）",
        "p3": "科学 （李广兰）",
        "p4": "体育与健康 （廉政）",
        "p5": "音乐 （张妙娟）",
        "p6": "劳动、综合实践（单亚飞）"
      },
      "周二": {
        "p1": "道德与法治 （钱少环）",
        "p2": "语文 （钱少环）",
        "p3": "信息科技 （冯雁冰）",
        "p4": "英语 （单亚飞）",
        "p5": "数学 （李坤雄）",
        "p6": "体育与健康 （廉政）"
      },
      "周三": {
        "p1": "语文 （钱少环）",
        "p2": "语文 （钱少环）",
        "p3": "数学 （李坤雄）",
        "p4": "科学  （李广兰）",
        "p5": "校本课程之心理健康 （钱少环、林雪美）",
        "p6": "体育与健康 （廉政）"
      },
      "周四": {
        "p1": "英语 （单亚飞)",
        "p2": "语文 （钱少环）",
        "p3": "语文之书法 （钱少环）",
        "p4": "数学 （李坤雄）",
        "p5": "美术 （程春苗）",
        "p6": "体育与健康 （李坤雄）"
      },
      "周五": {
        "p1": "英语 （单亚飞)",
        "p2": "语文 （钱少环）",
        "p3": "数学 （李坤雄）",
        "p4": "音乐美术 （张妙娟、程春苗）",
        "p5": "道德与法治 （钱少环）",
        "p6": "体育与健康 （李坤雄）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "四（2）": {
      "周一": {
        "p1": "数学 （张彩霞）",
        "p2": "语文 （胡咏敏）",
        "p3": "美术 （程春苗）",
        "p4": "劳动、综合实践（单亚飞）",
        "p5": "体育与健康 （张彩霞）",
        "p6": "音乐 （张妙娟）"
      },
      "周二": {
        "p1": "英语 （单亚飞)",
        "p2": "语文 （胡咏敏）",
        "p3": "体育与健康 （胡咏敏）",
        "p4": "信息科技 （冯雁冰）",
        "p5": "数学 （张彩霞）",
        "p6": "校本课程之心理健康 （胡咏敏、林雪美）"
      },
      "周三": {
        "p1": "语文 （胡咏敏）",
        "p2": "语文之书法 （胡咏敏）",
        "p3": "英语 （单亚飞)",
        "p4": "数学 （张彩霞）",
        "p5": "体育与健康 （张彩霞）",
        "p6": "道德与法治 （胡咏敏)"
      },
      "周四": {
        "p1": "语文 （胡咏敏）",
        "p2": "数学 （张彩霞）",
        "p3": "体育与健康 （廉政）",
        "p4": "道德与法治 （胡咏敏)",
        "p5": "科学 （李广兰）",
        "p6": "音乐美术 (张妙娟、程春苗)"
      },
      "周五": {
        "p1": "数学 （张彩霞）",
        "p2": "英语 （单亚飞)",
        "p3": "语文 （胡咏敏）",
        "p4": "语文 （胡咏敏）",
        "p5": "体育与健康  （廉政）",
        "p6": "科学 （李广兰）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "五（1）": {
      "周一": {
        "p1": "数学 （陈姿姿）",
        "p2": "语文 （梁结贞）",
        "p3": "体育与健康 （梁结贞）",
        "p4": "英语 （陈丽杰)",
        "p5": "音乐  （邓丽梅）",
        "p6": "信息科技 （冯雁冰）"
      },
      "周二": {
        "p1": "道德与法治 （陈丽杰）",
        "p2": "语文 （梁结贞）",
        "p3": "科学  （李广兰）",
        "p4": "体育与健康 （梁超财）",
        "p5": "数学 （陈姿姿）",
        "p6": "美术  （杨凤清）"
      },
      "周三": {
        "p1": "英语 （陈丽杰)",
        "p2": "语文 （梁结贞）",
        "p3": "体育与健康 （陈姿姿）",
        "p4": "音乐美术 (邓丽梅、杨凤清)",
        "p5": "道德与法治 （陈丽杰）",
        "p6": "科学 （李广兰）"
      },
      "周四": {
        "p1": "语文 （梁结贞）",
        "p2": "语文 （梁结贞）",
        "p3": "英语 （陈丽杰）",
        "p4": "数学 （陈姿姿）",
        "p5": "综合实践、劳动（梁结贞）",
        "p6": "体育与健康 （梁超才）"
      },
      "周五": {
        "p1": "语文 （梁结贞）",
        "p2": "道德与法治 （陈丽杰）",
        "p3": "数学 （陈姿姿）",
        "p4": "校本课程之主题班会、心理健康（邓丽梅、林雪美，）",
        "p5": "数学（陈姿姿）",
        "p6": "体育与健康 （梁结贞）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "五（2）": {
      "周一": {
        "p1": "英语 （唐楚儿）",
        "p2": "数学 （陈姿姿）",
        "p3": "校本课程之心理健康 （邓丽梅、林雪美）",
        "p4": "语文 （卢志堂）",
        "p5": "美术 （杨凤清）",
        "p6": "体育与健康  （梁超财）"
      },
      "周二": {
        "p1": "语文 （卢志堂）",
        "p2": "英语 （唐楚儿)",
        "p3": "道德与法治 （唐楚儿）",
        "p4": "综合实践/劳动 （梁结贞）",
        "p5": "体育与健康  （梁超财）",
        "p6": "数学 （陈姿姿）"
      },
      "周三": {
        "p1": "英语 （唐楚儿)",
        "p2": "数学 （陈姿姿）",
        "p3": "语文 （卢志堂）",
        "p4": "体育与健康（卢志堂）",
        "p5": "信息科技 （冯雁冰）",
        "p6": "音乐 （邓丽梅）"
      },
      "周四": {
        "p1": "数学 （陈姿姿）",
        "p2": "道德与法治  （唐楚儿）",
        "p3": "语文 （卢志堂）",
        "p4": "语文 （卢志堂）",
        "p5": "体育与健康 （陈姿姿）",
        "p6": "科学 （李广兰）"
      },
      "周五": {
        "p1": "语文 （卢志堂）",
        "p2": "道德与法治  （唐楚儿）",
        "p3": "音乐美术 ( 邓丽梅、杨凤清)",
        "p4": "数学 （陈姿姿）",
        "p5": "科学 （李广兰）",
        "p6": "体育与健康（卢志堂）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "六（1）": {
      "周一": {
        "p1": "数学 （梁思）",
        "p2": "语文 （韩文兰）",
        "p3": "英语 （唐惠芳）",
        "p4": "音乐美术 ( 张妙娟、程春苗)",
        "p5": "体育与健康 （廉政）",
        "p6": "科学  （李广兰）"
      },
      "周二": {
        "p1": "语文 （韩文兰）",
        "p2": "语文 （韩文兰）",
        "p3": "体育与健康 （廉政）",
        "p4": "英语 （唐惠芳）",
        "p5": "数学 （梁思）",
        "p6": "美术  （程春苗）"
      },
      "周三": {
        "p1": "数学 （梁思）",
        "p2": "英语 （唐惠芳）",
        "p3": "语文 （韩文兰）",
        "p4": "音乐 （张妙娟）",
        "p5": "道德与法治 （唐惠芳）",
        "p6": "体育与健康 （韩文兰）"
      },
      "周四": {
        "p1": "数学 （梁思）",
        "p2": "语文 （韩文兰）",
        "p3": "劳动/综合实践（韩文兰）",
        "p4": "道德与法治 （唐惠芳）",
        "p5": "体育与健康 （韩文兰）",
        "p6": "校本课程之心理健康 （韩文兰、林雪美）"
      },
      "周五": {
        "p1": "数学 （梁思）",
        "p2": "语文 （韩文兰）",
        "p3": "科学  （李广兰）",
        "p4": "道德与法治 （唐惠芳）",
        "p5": "体育与健康 （梁思）",
        "p6": "信息科技 （冯雁冰）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    },
    "六（2）": {
      "周一": {
        "p1": "英语 （唐惠芳）",
        "p2": "数学 （梁思）",
        "p3": "语文 （曾维东）",
        "p4": "体育与健康 （曾维东）",
        "p5": "劳动/综合实践（曾维东）",
        "p6": "道德与法治 （唐惠芳）"
      },
      "周二": {
        "p1": "语文 （曾维东）",
        "p2": "语文 （曾维东）",
        "p3": "英语 （唐惠芳）",
        "p4": "音乐美术 (张妙娟、程春苗)",
        "p5": "科学  （李广兰）",
        "p6": "体育与健康 （梁思）"
      },
      "周三": {
        "p1": "英语 （唐惠芳）",
        "p2": "数学 （梁思）",
        "p3": "数学 （梁思）",
        "p4": "语文 （曾维东）",
        "p5": "体育与健康 （廉政）",
        "p6": "音乐 （张妙娟）"
      },
      "周四": {
        "p1": "语文 （曾维东）",
        "p2": "道德与法治 （唐惠芳）",
        "p3": "数学 （梁思）",
        "p4": "科学  （李广兰）",
        "p5": "体育与健康 （曾维东）",
        "p6": "信息科技 （冯雁冰）"
      },
      "周五": {
        "p1": "道德与法治 （ 唐惠芳）",
        "p2": "数学 （梁思）",
        "p3": "语文 （曾维东）",
        "p4": "体育与健康 （曾维东）",
        "p5": "校本课程之心理活动（韩文兰、林雪美）",
        "p6": "美术 （程春苗）"
      },
      "周六": {
        "p1": null,
        "p2": null,
        "p3": null,
        "p4": null,
        "p5": null,
        "p6": null
      }
    }
  },
  "teacher_tang": {
    "周一 第四节": {
      "class": "二（1）",
      "subject": "英语 （唐楚儿）",
      "time": "11:20-12:00"
    },
    "周三 第五节": {
      "class": "二（1）",
      "subject": "英语  （唐楚儿）",
      "time": "14:15-14:55"
    },
    "周二 第四节": {
      "class": "二（2）",
      "subject": "英语 （唐楚儿）",
      "time": "11:20-12:00"
    },
    "周四 第六节": {
      "class": "二（2）",
      "subject": "英语 （唐楚儿）",
      "time": "15:10-15:50"
    },
    "周一 第一节": {
      "class": "五（2）",
      "subject": "英语 （唐楚儿）",
      "time": "8:20-9:00"
    },
    "周二 第二节": {
      "class": "五（2）",
      "subject": "英语 （唐楚儿)",
      "time": "9:15-9:55"
    },
    "周二 第三节": {
      "class": "五（2）",
      "subject": "道德与法治 （唐楚儿）",
      "time": "10:25-11:05"
    },
    "周三 第一节": {
      "class": "五（2）",
      "subject": "英语 （唐楚儿)",
      "time": "8:20-9:00"
    },
    "周四 第二节": {
      "class": "五（2）",
      "subject": "道德与法治  （唐楚儿）",
      "time": "9:15-9:55"
    },
    "周五 第二节": {
      "class": "五（2）",
      "subject": "道德与法治  （唐楚儿）",
      "time": "9:15-9:55"
    }
  }
};
